[
    {
        "id": 1,
        "titulo": "A Importância da Educação",
        "conteudo": "A educação é a base para uma sociedade mais justa e equitativa. Ela promove o desenvolvimento individual e coletivo, permitindo que pessoas realizem seu potencial. Investir em educação é investir no futuro de todos nós.",
        "data": "2024-11-22T03:00:00.000Z",
        "curtidas": 11,
        "comentarios": [
            {
                "id": 1753189145835,
                "autor": "Amanda",
                "conteudo": "testeee",
                "data": "2025-07-22T12:59:05.835Z"
            },
            {
                "id": 1753190155390,
                "autor": "Mariana",
                "conteudo": "hellooo",
                "data": "2025-07-22T13:15:55.390Z"
            }
        ]
    },
    {
        "id": 5,
        "titulo": "Economia Digital",
        "conteudo": "A transformação digital está mudando a maneira como fazemos negócios. Empresas que não se adaptam a essa nova realidade correm o risco de ficar obsoletas. A digitalização não é apenas uma tendência, mas uma necessidade para a sobrevivência no mercado. O futuro é digital, e devemos nos preparar para ele.",
        "data": "2024-08-23T03:00:00.000Z",
        "curtidas": 12,
        "comentarios": []
    },
    {
        "id": 7,
        "titulo": "Mobilidade Urbana",
        "conteudo": "Soluções de mobilidade inteligente são o futuro das grandes cidades. O crescimento populacional exige novas abordagens para o transporte urbano. A integração de tecnologia no transporte pode melhorar a qualidade de vida nas cidades. Investir em mobilidade sustentável é essencial para um futuro melhor.",
        "data": "2024-06-13T03:00:00.000Z",
        "curtidas": 9,
        "comentarios": []
    },
    {
        "id": 2,
        "titulo": "Tecnologia e Inovação",
        "conteudo": "Vivemos em uma era onde a tecnologia avança a passos largos. Inovações constantes estão mudando a forma como vivemos, trabalhamos e nos comunicamos. É essencial acompanhar essas mudanças para não ficarmos para trás. A tecnologia tem o poder de transformar o mundo em que vivemos.",
        "data": "2023-11-24T03:00:00.000Z",
        "curtidas": 15,
        "comentarios": []
    },
    {
        "id": 9,
        "titulo": "Alimentação Saudável",
        "conteudo": "Uma dieta equilibrada é essencial para manter corpo e mente saudáveis. Os alimentos que consumimos impactam diretamente nossa saúde e bem-estar. Fazer escolhas alimentares conscientes pode prevenir doenças e melhorar a qualidade de vida. Invista em uma alimentação rica em nutrientes e pobre em alimentos processados.",
        "data": "2022-06-16T03:00:00.000Z",
        "curtidas": 11,
        "comentarios": []
    },
    {
        "id": 3,
        "titulo": "Sustentabilidade Ambiental",
        "conteudo": "Preservar o meio ambiente é crucial para o futuro das próximas gerações. Cada ação nossa tem um impacto, e precisamos ser conscientes das nossas escolhas. A sustentabilidade não é uma opção, mas uma necessidade urgente. Devemos agir agora para garantir um planeta habitável no futuro.",
        "data": "2022-01-19T03:00:00.000Z",
        "curtidas": 20,
        "comentarios": []
    },
    {
        "id": 6,
        "titulo": "Impacto das Redes Sociais",
        "conteudo": "As redes sociais têm um papel central na comunicação moderna. Elas conectam pessoas em todo o mundo, criando novas formas de interação. No entanto, também trazem desafios, como a disseminação de informações falsas. É crucial usar essas ferramentas de forma responsável e consciente.",
        "data": "2021-12-05T03:00:00.000Z",
        "curtidas": 7,
        "comentarios": []
    },
    {
        "id": 10,
        "titulo": "Inovações na Saúde",
        "conteudo": "A tecnologia está revolucionando o setor de saúde com novos tratamentos. Inovações como a telemedicina estão tornando o atendimento mais acessível. A pesquisa e o desenvolvimento em saúde estão em um ritmo acelerado, trazendo esperança para muitas doenças. O futuro da saúde está cada vez mais integrado com a tecnologia.",
        "data": "2021-06-03T03:00:00.000Z",
        "curtidas": 13,
        "comentarios": []
    },
    {
        "id": 4,
        "titulo": "Saúde e Bem-Estar",
        "conteudo": "Manter o bem-estar físico e mental é essencial para uma vida equilibrada. O cuidado com a saúde deve ser uma prioridade diária. Pequenos hábitos saudáveis podem fazer uma grande diferença a longo prazo. Não negligencie seu bem-estar, ele é a chave para uma vida plena.",
        "data": "2021-02-14T03:00:00.000Z",
        "curtidas": 8,
        "comentarios": []
    },
    {
        "id": 8,
        "titulo": "Educação Financeira",
        "conteudo": "Gerir as finanças pessoais é fundamental para a estabilidade econômica. A educação financeira deve começar desde cedo, para evitar problemas no futuro. Entender como o dinheiro funciona é o primeiro passo para uma vida financeira saudável. Planejamento e controle são as chaves para o sucesso financeiro.",
        "data": "2020-06-02T03:00:00.000Z",
        "curtidas": 5,
        "comentarios": []
    }
]